<?php

return [
    "errors" => [
        100 => "عملیات با موفقیت انجام شده است",
        -1 => "اطلاعات ارسال شده ناقص است.",
        -2 => "IP يا Merchant Code پذيرنده صحيح نيست.",
        -3 => "با توجه به محدوديت هاي شاپرك امكان پرداخت با رقم درخواست شده ميسر نمي باشد.",
        -11 => "درخواست مورد نظر يافت نشد.",
        -21 => "هيچ نوع عمليات مالي براي اين تراكنش يافت نشد.",
        -22 => "تراكنش نا موفق مي باشد.",
        -33 => "رقم تراكنش با رقم پرداخت شده مطابقت ندارد.",
        -40 => "اجازه دسترسي به متد مربوطه وجود ندارد.",
        -41 => "اطلاعات ارسال شده مربوط به AdditionalData غيرمعتبر ميباشد.",
        -100 => "در انتظار پرداخت.",
        -101 => "آدرس بازگشت مشتری خالی است.",
        -102 => "در پرداخت خطایی رخ داده است.",
        -103 => "وضعیت پرداخت جهت تایید نادرست است.",
        -104 => "فروشگاهی با شناسه ارسالی یافت نشد.",
        -105 => "شناسه مرجع تراکنش اشتباه است",
        -106 => "خطای تایید پرداخت.",
        -107 => "وضعیت پرداخت صحیح نیست.",
        -109 => "فروشگاه غیر فعال است.",
        -110 => "شناسه ارسال شده نامعتبر است.",
        -111 => "پرداخت با شناسه ارسالی یافت نشد.",
        -112 => "فرمت توضیحات اشتباه است.",
        -113 => "فرمت موبایل اشتباه است.",
    ]
];